Autodesk.Revit.DB.Structure.RebarConstraintType.ToSurface
Handle is constrained to a surface.

Autodesk.Revit.DB.Structure.RebarConstraintType.ToOtherRebar
Handle is attached to a handle on another Rebar Element.
It doesn't matter the style (Standard/Stirrup) of this or the other Rebar element.